In [49]:
# Import needed libraries

import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [50]:
# Read the entry dataset

employees = pd.read_csv(
	filepath_or_buffer='./employees.csv',
	dtype={
		'Education': 'string',
		'JoiningYear': 'int16',
		'City': 'string',
		'PaymentTier': 'int8',
		'Age': 'int8',
		'Gender': 'string',
		'EverBenched': 'string',
		'ExperienceInCurrentDomain': 'int8',
		'LeaveOrNot': 'int8'
	}
)
employees

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

In [53]:
# Shape of the dataset

rows, columns = employees.shape
size = employees.size
print(f'Dataset shape is {rows} rows x {columns} columns - {size} elements in total')

Dataset shape is 4653 rows x 9 columns - 41877 elements in total

In [54]:
# Concise summary of the dataset

employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   string
 1   JoiningYear                4653 non-null   int16
 2   City                       4653 non-null   string
 3   PaymentTier                4653 non-null   int8
 4   Age                        4653 non-null   int8
 5   Gender                     4653 non-null   string
 6   EverBenched                4653 non-null   string
 7   ExperienceInCurrentDomain  4653 non-null   int8
 8   LeaveOrNot                 4653 non-null   int8
dtypes: int16(1), int8(4), string(4)
memory usage: 172.8 KB

As we can see, there are not any missing values

In [56]:
# Number of unique values in each column

employees.nunique()

Education                     3
JoiningYear                   7
City                          3
PaymentTier                   3
Age                          20
Gender                        2
EverBenched                   2
ExperienceInCurrentDomain     8
LeaveOrNot                    2
dtype: int64

In [59]:
# Duplicate rows appearing in the datates

from os import dup


duplicates = employees.duplicated().sum()
print(f'Duplicate rows: {duplicates}')

Duplicate rows: 1889

In [48]:
# Statistical summary of the dataset

employees.describe()

,JoiningYear,PaymentTier,Age,ExperienceInCurrentDomain,LeaveOrNot
count,4653.000000,4653.000000,4653.000000,4653.000000,4653.000000
mean,2015.062970,2.698259,29.393295,2.905652,0.343864
std,1.863377,0.561435,4.826087,1.558240,0.475047
min,2012.000000,1.000000,22.000000,0.000000,0.000000
25%,2013.000000,3.000000,26.000000,2.000000,0.000000
50%,2015.000000,3.000000,28.000000,3.000000,0.000000
75%,2017.000000,3.000000,32.000000,4.000000,1.000000
max,2018.000000,3.000000,41.000000,7.000000,1.000000